Autodesk.Revit.DB.GeometryTypeConversionPriorities.TargetsAreValid(Autodesk.Revit.DB.GeometryConversionTarget,Autodesk.Revit.DB.GeometryConversionTarget)
Checks whether the primary and secondary targets are a valid combination.
A valid combination is one of the following:
* primaryTarget = Solid, secondaryTarget = Mesh or None
* primaryTarget = Mesh, secondaryTarget = Solid or None
* primaryTarget = None, secondaryTarget = None
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.GeometryTypeConversionPriorities.SecondaryTarget
The secondary Revit geometry type to create from the external geometry when
the conversion to the primary type fails.
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.PrimaryTarget
The primary Revit geometry type to create from the external geometry.
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.#ctor(Autodesk.Revit.DB.GeometryConversionTarget,Autodesk.Revit.DB.GeometryConversionTarget)
Specifies conversion which preferentially converts to the primaryTarget.  If this
conversion fails, a conversion to the secondaryTarget is attempted instead.  If
both conversions fail, nothing will be produced.  If both targets are None, no attempt
to convert the geometry will be made.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The requested combination of targets is invalid.
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.#ctor(Autodesk.Revit.DB.GeometryConversionTarget)
Specifies conversion to the given target type only.  If the conversion fails,
nothing will be produced.  If the target is None, no attempt to convert the geometry
will be made.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities
Specifies the primary and, optionally a secondary, target for conversion of a
particular type of geometry.
Since:
2022